<template>
  <div class="pdf-container">
    <div class="page1-box">
      <!-- 个人信息 -->
      <div class="pdf-header">
        <div class="message">
          <div class="message-name">陈少聪</div>
          <div class="message-contact">
            <span>199-3716-6264 | csc522684186@163.com</span>
          </div>
          <div class="message-contact">
            <span>个人博客 | <a href="https://www.chenchenshao.com">www.chenchenshao.com</a></span>
          </div>
        </div>
        <div class="avatar-img">
          <img src="../assets/imgs/avatar-pdf.png" alt="" />
        </div>
      </div>
      <!-- 教育背景标题 -->
      <div class="page1-title">
        <div class="svg-logo">
          <svg t="1654863020054" class="icon" viewBox="0 0 1377 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2142" width="16" height="16">
            <path
              d="M1318.13181 288.735492l-616.415492-219.428571c-5.98146-2.145524-12.483048-2.145524-18.399492 0L72.492698 286.004825C62.415238 289.580698 55.523556 298.682921 55.003429 309.020444 54.548317 319.357968 60.399746 329.045333 70.087111 333.596444L193.097143 391.135492C156.493206 435.216254 151.356952 513.690413 150.966857 548.148825c-28.151873 18.919619-35.693714 40.374857-36.668952 55.913651-2.145524 32.117841 21.455238 58.839365 37.384127 73.077841-24.706032 123.270095-107.341206 200.443937-108.121397 201.289143-5.916444 5.461333-8.97219 13.263238-8.192 21.195175 0.715175 7.866921 5.20127 15.018667 12.092952 19.309714l87.641397 54.873397c4.356063 2.730667 9.362286 4.161016 14.433524 4.161016 3.055746 0 6.176508-0.520127 9.102222-1.560381 133.087492-46.876444 111.567238-261.558857 103.830349-315.652063 17.48927-22.105397 24.836063-44.405841 21.715302-66.381206C281.323683 574.025143 270.140952 559.396571 261.03873 550.619429 232.171683 354.596571 398.612317 456.801524 379.172571 449.714794l303.949206 110.331937c6.046476 2.145524 12.678095 2.145524 18.659556 0l616.415492-222.744381c10.467556-3.770921 17.424254-13.458286 17.359238-24.315937S1328.599365 292.506413 1318.13181 288.735492zM219.753651 584.297651c0.130032 0.065016 10.337524 6.956698 11.637841 17.424254 1.430349 11.702857-8.387048 25.031111-16.904127 34.133333-5.461333 5.916444-7.866921 13.913397-6.501587 21.780317 10.987683 61.635048 20.740063 223.459556-56.173714 265.199746l-48.956952-30.622476c31.727746-36.798984 87.186286-114.297905 104.155429-221.314032 1.495365-9.622349-2.730667-19.309714-10.922667-25.031111-10.07746-6.891683-29.387175-25.876317-28.541968-38.359365C168.131048 598.276063 182.044444 589.758984 190.366476 585.467937 199.338667 580.85181 204.8 571.619556 204.474921 561.737143 202.459429 506.538667 215.917714 421.432889 250.896254 412.460698 227.425524 442.563048 206.230349 490.089651 207.660698 563.102476 207.855746 571.489524 212.601905 579.551492 219.753651 584.297651zM692.484063 508.229079 149.991619 313.571556l542.427429-192.446984 539.56673 192.056889L692.484063 508.229079zM1082.644317 450.364952l-376.116825 123.400127L324.819302 450.299937c-8.061968-2.600635-17.099175-1.365333-24.055873 3.575873C293.80673 458.752 289.645714 466.553905 289.645714 474.810921l0 82.310095c0 8.842159 4.681143 17.16419 12.418032 21.845333 15.148698 9.29727 23.79581 20.154921 26.396444 33.223111 4.681143 23.210667-10.532571 50.25727-16.774095 58.579302-7.736889 10.272508-6.631619 24.510984 2.665651 33.54819 96.288508 93.687873 260.128508 113.387683 380.732952 113.387683 85.430857 0 148.756317-9.687365 152.527238-10.272508 239.908571-47.656635 266.695111-121.189587 269.685841-135.493079 0.325079-1.625397 0.520127-3.380825 0.520127-5.071238L1117.817905 474.875937c0-8.322032-4.096-16.188952-11.117714-21.000127C1099.678476 448.999619 1090.771302 447.699302 1082.644317 450.364952zM1064.504889 661.731556 1064.504889 661.731556c-6.176508 10.142476-44.210794 58.514286-226.38527 94.728127-1.430349 0.195048-319.227937 48.436825-470.909968-75.353397 9.492317-18.529524 19.829841-47.461587 13.783365-78.344127C376.571937 579.876571 363.503746 559.786667 343.088762 543.857778L343.088762 510.764698l355.116698 114.818032c5.461333 1.820444 11.442794 1.820444 16.969143 0l349.330286-114.622984L1064.504889 661.731556z"
              p-id="2143"
              :fill="fill"
            ></path>
          </svg>
        </div>

        <div class="title-left">教育经历</div>
      </div>
      <hr />
      <!-- 教育背景内容 -->
      <div class="school">
        <span class="bold">桂林电子科技大学</span>
        <span>2020年9月-2023年6月</span>
      </div>
      <div class="school">
        <span>机械工程 硕士</span>
        <span>桂林</span>
      </div>
      <div class="school">
        <span class="bold">华北水利水电大学</span>
        <span>2016年9月-2020年6月</span>
      </div>
      <div class="school">
        <span>车辆工程 本科</span>
        <span>郑州</span>
      </div>

      <!-- 标题 -->
      <div class="page1-title">
        <div class="svg-logo">
          <svg t="1654930581724" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="25991" width="18" height="18">
            <path
              d="M256 298.666667v560.682666l278.186667-126.805333 276.48 126.72V170.666667H256v85.333333h554.666667v42.666667H256z m0-170.666667h554.666667a42.666667 42.666667 0 0 1 42.666666 42.666667v688.554666a42.666667 42.666667 0 0 1-60.458666 38.826667l-258.773334-118.613333-260.394666 118.741333A42.666667 42.666667 0 0 1 213.333333 859.349333V170.666667a42.666667 42.666667 0 0 1 42.666667-42.666667z"
              :fill="fill"
              p-id="25992"
            ></path>
          </svg>
        </div>
        <div class="title-left">专业技能</div>
      </div>

      <hr />
      <div class="skill-box">
        <ul>
          <li>
            <span>理解TCP/IP、HTTP协议、浏览器工作原理</span>
          </li>
          <li>
            <span>熟练使用HTML+CSS3，会使用SCSS、Less等CSS预处理器，对页面进行高度还原</span>
          </li>
          <li>
            <span>熟悉JavaScript、Vue全家桶的使用及uni-app的使用，能在项目中使用模块化开发，并对公共组件、函数进行适当封装</span>
          </li>
          <li>
            <span>熟悉Node.js，能够使用Express框架搭建本地服务器进行模拟接口请求</span>
          </li>
          <li>
            <span>了解Linux、Git、MySQL、Java的基本使用</span>
          </li>
        </ul>
      </div>
      <!-- 标题 -->
      <div class="page1-title">
        <div class="svg-logo">
          <svg t="1654863907141" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6310" width="16" height="16">
            <path
              d="M512 627.2c-10.666667 0-19.2-2.133333-27.733333-8.533333L89.6 381.866667c-25.6-14.933333-34.133333-46.933333-19.2-72.533334 4.266667-8.533333 10.666667-12.8 19.2-19.2L484.266667 53.333333c17.066667-10.666667 38.4-10.666667 55.466666 0l394.666667 236.8c25.6 14.933333 34.133333 49.066667 17.066667 72.533334-4.266667 6.4-10.666667 12.8-17.066667 17.066666L539.733333 618.666667c-8.533333 4.266667-17.066667 8.533333-27.733333 8.533333zM138.666667 337.066667L512 561.066667l373.333333-224L512 113.066667 138.666667 337.066667z"
              p-id="6311"
              :fill="fill"
            ></path>
            <path
              d="M512 802.133333c-10.666667 0-19.2-2.133333-27.733333-8.533333l-426.666667-256c-14.933333-8.533333-21.333333-27.733333-10.666667-44.8 8.533333-14.933333 27.733333-19.2 44.8-10.666667L512 736l420.266667-251.733333c14.933333-8.533333 34.133333-4.266667 44.8 10.666666s4.266667 34.133333-10.666667 44.8l-426.666667 253.866667c-8.533333 6.4-17.066667 8.533333-27.733333 8.533333z"
              p-id="6312"
              :fill="fill"
            ></path>
            <path
              d="M512 977.066667c-10.666667 0-19.2-2.133333-27.733333-8.533334l-426.666667-256c-14.933333-8.533333-19.2-27.733333-10.666667-44.8s27.733333-19.2 44.8-10.666666L512 910.933333l420.266667-251.733333c14.933333-8.533333 34.133333-4.266667 44.8 10.666667s4.266667 34.133333-10.666667 44.8l-424.533333 256c-10.666667 4.266667-19.2 6.4-29.866667 6.4z"
              p-id="6313"
              :fill="fill"
            ></path>
          </svg>
        </div>
        <div class="title-left">项目经验</div>
      </div>
      <hr />
      <div class="entrepot">
        <span> <span style="font-weight: bold">gitee：</span><a href="https://gitee.com/chenchenshao">https://gitee.com/chenchenshao</a></span>
        <span> <span style="font-weight: bold">github：</span><a href="https://github.com/ganyihangxingyihang">https://github.com/ganyihangxingyihang</a></span>
      </div>
      <div class="project-box">
        <div class="project1">
          <div class="project-name">1.后台管理系统</div>
          <div class="project-stack">技术栈：Vue+Vue Router+axios+Element UI</div>
          <div class="project-content">
            <span>主要内容：</span>
            <li>登录页面：登录验证，全局导航守卫，axios拦截器；</li>
            <li>导航栏：菜单栏刷新高亮，内容组件过渡效果；</li>
            <li>内容页面：处理异步请求返回值，作用域插槽操作数据，全局过滤器处理数据，列表渲染。</li>
          </div>
          <div class="project-grow">项目成长：接触Vue以来做的第一个练手项目，系统的了解和学习了前端项目开发流程。</div>
        </div>

        <div class="project2">
          <div class="project-name">2.智慧家庭服务机器人系统</div>
          <div class="project-stack">技术栈：H5+JavaScript+Java+ROS</div>
          <div class="project-content">
            <span>主要内容：</span>
            <li>浏览器端：进行全屋建模，实时反馈机器人位置，编写服务端接口实现特定功能，部署网页到服务器；</li>
            <li>Android端：编写逻辑代码，使用Intent和Broadcast进行组件间通讯，使用ROSBridge进行Android和ROS间的通信；</li>
            <li>Linux端：使用Topic进行节点间通讯，基于Service的双向服务调用。</li>
          </div>
          <div class="project-grow">项目成长：学习了Java编程基础和Android消息传递机制，掌握了Linux系统基本操作，掌握了部署服务器、网页、接口的完整流程。</div>
        </div>

        <div class="project3">
          <div class="project-name">3.简易网上购物小程序</div>
          <div class="project-stack">技术栈：vue2+vuex+小程序组件库</div>
          <div class="project-content">
            <span>主要内容：</span>
            <li>商品列表：搜索框防抖处理，上拉加载时定义节流阀防止发起额外请求；</li>
            <li>购物车功能：vuex实现数据共享和持久化购物车数据，商品全选/反选功能，动态渲染商品总价格，实现微信支付；</li>
            <li>个人中心：用户登录、退出功能。</li>
          </div>
          <div class="project-grow">项目成长：了解了uni-app框架项目开发流程，掌握了vuex核心概念及使用规范。</div>
        </div>
      </div>

      <div class="page1-title">
        <div class="svg-logo">
          <svg t="1654863907141" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6310" width="16" height="16">
            <path
              d="M512 627.2c-10.666667 0-19.2-2.133333-27.733333-8.533333L89.6 381.866667c-25.6-14.933333-34.133333-46.933333-19.2-72.533334 4.266667-8.533333 10.666667-12.8 19.2-19.2L484.266667 53.333333c17.066667-10.666667 38.4-10.666667 55.466666 0l394.666667 236.8c25.6 14.933333 34.133333 49.066667 17.066667 72.533334-4.266667 6.4-10.666667 12.8-17.066667 17.066666L539.733333 618.666667c-8.533333 4.266667-17.066667 8.533333-27.733333 8.533333zM138.666667 337.066667L512 561.066667l373.333333-224L512 113.066667 138.666667 337.066667z"
              p-id="6311"
              :fill="fill"
            ></path>
            <path
              d="M512 802.133333c-10.666667 0-19.2-2.133333-27.733333-8.533333l-426.666667-256c-14.933333-8.533333-21.333333-27.733333-10.666667-44.8 8.533333-14.933333 27.733333-19.2 44.8-10.666667L512 736l420.266667-251.733333c14.933333-8.533333 34.133333-4.266667 44.8 10.666666s4.266667 34.133333-10.666667 44.8l-426.666667 253.866667c-8.533333 6.4-17.066667 8.533333-27.733333 8.533333z"
              p-id="6312"
              :fill="fill"
            ></path>
            <path
              d="M512 977.066667c-10.666667 0-19.2-2.133333-27.733333-8.533334l-426.666667-256c-14.933333-8.533333-19.2-27.733333-10.666667-44.8s27.733333-19.2 44.8-10.666666L512 910.933333l420.266667-251.733333c14.933333-8.533333 34.133333-4.266667 44.8 10.666667s4.266667 34.133333-10.666667 44.8l-424.533333 256c-10.666667 4.266667-19.2 6.4-29.866667 6.4z"
              p-id="6313"
              :fill="fill"
            ></path>
          </svg>
        </div>
        <div class="title-left">实习经历</div>
      </div>
      <hr />
      <div class="project-box" style="display: flex; justify-content: space-between; padding: 0 10px 0 26px"><span>中国科学院深圳先进技术研究院智能仿生中心</span><span>2021年7月-至今</span></div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      fill: '#4283FF'
    }
  }
}
</script>

<style lang="less" scoped>
// 加粗
.bold {
  font-weight: bold;
}

.pdf-container {
  box-sizing: border-box;
  width: 70%;
  height: 1198px;
  margin-left: 6%;
  font-family: arial, Microsoft YaHei;

  .page1-box {
    background-color: rgb(255, 255, 255);
    padding: 20px 20px;
    color: #010101;
    font-size: 12px;
    border: 1px solid #ccc;
    box-shadow: 0 0 5px 0 rgba(0, 0, 0, 0.1), 0 0 168px 13px rgba(7, 0, 0, 0.1);

    //pdf头部
    .pdf-header {
      width: 100%;
      height: 130px;
      position: relative;
      display: flex;
      justify-content: center;

      .message {
        display: flex;
        flex-direction: column;
        align-items: center;
        .message-name {
          padding-top: 20px;
          font-size: 18px;
          font-weight: bold;
          margin-bottom: 5px;
        }

        .message-contact {
          height: 20px;
          line-height: 20px;

          a {
            text-decoration: none;
          }
        }
      }

      .avatar-img {
        width: 120px;
        height: 130px;
        position: absolute;
        top: 0;
        right: 0px;

        img {
          height: 100%;
        }
      }
    }

    // 头部标题
    .page1-title {
      display: flex;
      font-size: 1.35em;
      line-height: 1.35em;
      font-weight: bold;
      color: #4283ff;
      align-items: center;
      margin: 3px 0;

      //去除svg图底部空白 还可以用 vertical-align:middle
      .svg-logo svg {
        display: block;
      }

      .title-left {
        width: 15%;
        margin-left: 5px;
      }
    }

    hr {
      background-color: rgb(194, 219, 253);
      //hr默认有边框，所以要去掉
      height: 1px;
      border: none;
      margin-bottom: 5px;
    }

    //教育背景
    .school {
      display: flex;
      justify-content: space-between;
      margin-bottom: 3px;
      padding-left: 26px;
    }

    .skill-box {
      padding-left: 26px;

      ul li {
        margin: 3px 0;
      }
    }

    .entrepot {
      display: flex;
      margin: 10px 0;
      padding: 0 0 0 24px;
      span:nth-child(2) {
        margin-left: 66px;
      }
      a {
        text-decoration: none;
      }
    }
    .project-box {
      padding-left: 26px;
      line-height: 20px;

      .project-name {
        font-weight: bold;
      }
    }
  }
}
</style>
